In [24]:
import pandas as pd

In [25]:
#Dicionário
Dicionario = {
    'A' : [1, 2, 3],
    'B' : [-3, -2, -1],
    'C' : [0, 10, 20]
}
Label = ['1º Linha', '2º Linha', '3º Linha']
Dataframe_01 = pd.DataFrame(Dicionario, index=Label)
print(Dataframe_01)

          A  B   C
1º Linha  1 -3   0
2º Linha  2 -2  10
3º Linha  3 -1  20

In [26]:
Dataframe_01[['A', 'B']]

          A  B
1º Linha  1 -3
2º Linha  2 -2
3º Linha  3 -1

In [27]:
Dataframe_01['Nova Coluna'] = Dataframe_01['A']*Dataframe_01['B']

In [28]:
Dataframe_01

          A  B   C  Nova Coluna
1º Linha  1 -3   0           -3
2º Linha  2 -2  10           -4
3º Linha  3 -1  20           -3

In [29]:
Dataframe_01

          A  B   C  Nova Coluna
1º Linha  1 -3   0           -3
2º Linha  2 -2  10           -4
3º Linha  3 -1  20           -3

In [30]:
Dataframe_01.loc['3º Linha']

A               3
B              -1
C              20
Nova Coluna    -3
Name: 3º Linha, dtype: int64

In [31]:
Dataframe_01.loc[['1º Linha', '2º Linha'],['A', 'C']]

          A   C
1º Linha  1   0
2º Linha  2  10

In [32]:
Dataframe_01.iloc[1:2, 0:]

          A  B   C  Nova Coluna
2º Linha  2 -2  10           -4

In [33]:
print(Dataframe_01)
Dataframe_01 > 0

          A  B   C  Nova Coluna
1º Linha  1 -3   0           -3
2º Linha  2 -2  10           -4
3º Linha  3 -1  20           -3

             A      B      C  Nova Coluna
1º Linha  True  False  False        False
2º Linha  True  False   True        False
3º Linha  True  False   True        False

In [34]:
Filtro = Dataframe_01['C'] > 0
Dataframe_02 = Dataframe_01[Filtro]
Dataframe_02['A']

2º Linha    2
3º Linha    3
Name: A, dtype: int64

In [35]:
Filtro

1º Linha    False
2º Linha     True
3º Linha     True
Name: C, dtype: bool

In [36]:
Dataframe_01[(Dataframe_01['B'] > 5) | (Dataframe_01['C'] > 2)]

          A  B   C  Nova Coluna
2º Linha  2 -2  10           -4
3º Linha  3 -1  20           -3

In [37]:
Dataframe_01.reset_index(inplace=True)

In [38]:
Dataframe_01

      index  A  B   C  Nova Coluna
0  1º Linha  1 -3   0           -3
1  2º Linha  2 -2  10           -4
2  3º Linha  3 -1  20           -3

In [39]:
Dataframe_01.drop('index', axis=1, inplace=True)

In [40]:
Dataframe_01

   A  B   C  Nova Coluna
0  1 -3   0           -3
1  2 -2  10           -4
2  3 -1  20           -3

In [41]:
Dataframe_01

   A  B   C  Nova Coluna
0  1 -3   0           -3
1  2 -2  10           -4
2  3 -1  20           -3

In [42]:
disc = {
    'A' : [1,2,4],
    'B' : [-2,-23,90],
    'Z' : ['A', 'FF', 'ZS']
}
disc2 = {
    'ADS' : [112,232,43],
    'BGR' : [-2321,-223,9210],
    'LOOP' : ['AASD', 'FF', 'ZFFS']
}

label01 = ['1', '2', '3']
dt = pd.DataFrame(disc, index=label01)
dt2 = pd.DataFrame(disc2, index=label01)

In [43]:
dt.join(dt2)

   A   B   Z  ADS   BGR  LOOP
1  1  -2   A  112 -2321  AASD
2  2 -23  FF  232  -223    FF
3  4  90  ZS   43  9210  ZFFS